/********************************************************************************
 * @classDescription 주가 계산기 API js
 * @author kw
 * @version 1.0
 * -------------------------------------------------------------------------------
 * Modification Information
 * Date              Developer           Content
 * ----------        -------------       -------------------------
 * 2025/06/19        김건우               신규생성
 * -------------------------------------------------------------------------------
 *********************************************************************************/
"use strict";
/********************************************************************************
 * Api Object
 ********************************************************************************/
const CalculatorApi = {

    /********************************************************************************
     * Variable Object : 페이지 내 전역 Object
     ********************************************************************************/
    name: "CalculatorApi",
    requestmapping: "/api/calculator",

    /********************************************************************************
     * Main Object
     ********************************************************************************/
    //분류 트리 XML 조회
    getCateTreeXml: (params) => {
        return kwfw.ajax({url: `${CalculatorApi.requestmapping}/cate-tree-xml`, params});
    },

    //분류 저장
    saveCate: (params) => {
        return kwfw.ajax({url: `${CalculatorApi.requestmapping}/cate-save`, params});
    },

    //분류 표시순서 저장
    saveCateDispOrder: (params) => {
        return kwfw.ajax({url: `${CalculatorApi.requestmapping}/cate-save-disp-order`, params});
    },


    /********************************************************************************
     * Dummay Object : 더미
     ********************************************************************************/
    endApi: function () {
    }
};